#ifndef MY_FUNCTION_H
#define MY_FUNCTION_H

#include <stdio.h>
#include <WinSock2.h>

#pragma comment(lib, "ws2_32.lib")

#define DEF_PORT		10000
#define BUFFER_SIZE		SO_MAX_MSG_SIZE

/************************************************************************/
/* 创建一个监听套接字并把本地套接字地址(本地IP地址和本地端口)绑定到监听套接字                                                                     */
/************************************************************************/
SOCKET BindListen(void);

/************************************************************************/
/* 接受客户端的连接请求                                                                     */
/************************************************************************/
SOCKET AcceptConnection(SOCKET hListenSocket);

/************************************************************************/
/* 接受客户端的数据并回显                                                                     */
/************************************************************************/
bool ProcessConnection(SOCKET hClientSocket);

/************************************************************************/
/* 关闭当前客户端连接                                                                     */
/************************************************************************/
bool ShutdownConnection(SOCKET hClientSocket);

/************************************************************************/
/* 服务器主体函数                                                                     */
/************************************************************************/
void DoWork(void);
#endif